In [21]:
import numpy as np
import pandas as pd


df = pd.DataFrame({"Age":[21,23,43,22,25],"Gender":['M','F','F','M','M']},index = ['a','b','c','d','e'])
df

   Age Gender
a   21      M
b   23      F
c   43      F
d   22      M
e   25      M

In [24]:
df["Salary"] = [20000,24000,30000,25000,40000]
df

   Age Gender  Salary
a   21      M   20000
b   23      F   24000
c   43      F   30000
d   22      M   25000
e   25      M   40000

### Accesing/Extracting values of rows and columns by using iloc[] , which uses the row index numbers and column index numbers

In [26]:
df.iloc[:,:]    # Accesing all rows with all columns

   Age Gender  Salary
a   21      M   20000
b   23      F   24000
c   43      F   30000
d   22      M   25000
e   25      M   40000

In [31]:
df.iloc[1:3,0:2]   # Accessing multiple rows with multiple columns using slicing

   Age Gender
b   23      F
c   43      F

In [30]:
df.iloc[[0,2,3],[1,2]]    # Accessing multiple rows and columns using list of index numbers

  Gender  Salary
a      M   20000
c      F   30000
d      M   25000

In [32]:
df.iloc[0,1]    # Accessing single value

'M'

In [33]:
df.iloc[4,2]

40000

In [34]:
df.iloc[1,:]   # Accessing single row with all columns

Age          23
Gender        F
Salary    24000
Name: b, dtype: object

### Accesing/Extracting values of rows and columns by using loc[] , which uses the row index names and column names.

In [36]:
df.loc['a','Salary']    # Accessing single value

20000

In [37]:
df.loc['e','Gender']

'M'

In [40]:
df.loc['a':,'Gender']   # Accessing single row with all columns

a    M
b    F
c    F
d    M
e    M
Name: Gender, dtype: object

In [41]:
df.loc[:,'Age']   # Accessing all row with single column

a    21
b    23
c    43
d    22
e    25
Name: Age, dtype: int64

In [42]:
df.loc['a':'c','Age':'Gender']   # Accessing multiple rows with multiple columns   
# While sclicing using loc[] we use index names not index numbers so thats why the last index names also include in output

   Age Gender
a   21      M
b   23      F
c   43      F

In [43]:
df.loc[['a','c','e'],['Age','Gender']]   # Accessing multiple rows with multiple columns

   Age Gender
a   21      M
c   43      F
e   25      M

In [44]:
df.loc[:,:]   # Accessing all rows with all columns

   Age Gender  Salary
a   21      M   20000
b   23      F   24000
c   43      F   30000
d   22      M   25000
e   25      M   40000

In [46]:
df.loc[['a','c','e']]   # Accessing multiple rows with all columns

   Age Gender  Salary
a   21      M   20000
c   43      F   30000
e   25      M   40000

In [52]:
df.loc[:,"Age"]

a    21
b    23
c    43
d    22
e    25
Name: Age, dtype: int64